droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xs_gpio_ctrl_regs.xml
	<register id="GPBMUX2" width="32" page="1" offset="0x48" internal="0" description="GPIO B Mux 2 Register (GPIO48 to 63)">
		<bitfield id="GPIO48" description="Defines pin-muxing selection for GPIO48" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO49" description="Defines pin-muxing selection for GPIO49" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO50" description="Defines pin-muxing selection for GPIO50" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO51" description="Defines pin-muxing selection for GPIO51" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO52" description="Defines pin-muxing selection for GPIO52" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO53" description="Defines pin-muxing selection for GPIO53" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO54" description="Defines pin-muxing selection for GPIO54" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO55" description="Defines pin-muxing selection for GPIO55" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO56" description="Defines pin-muxing selection for GPIO56" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO57" description="Defines pin-muxing selection for GPIO57" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO58" description="Defines pin-muxing selection for GPIO58" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO59" description="Defines pin-muxing selection for GPIO59" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO60" description="Defines pin-muxing selection for GPIO60" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO61" description="Defines pin-muxing selection for GPIO61" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO62" description="Defines pin-muxing selection for GPIO62" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO63" description="Defines pin-muxing selection for GPIO63" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
	<register id="GPBDIR" width="32" page="1" offset="0x4a" internal="0" description="GPIO B Direction Register (GPIO32 to 63)">
		<bitfield id="GPIO32" description="Defines direction for this pin in GPIO mode" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO33" description="Defines direction for this pin in GPIO mode" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO34" description="Defines direction for this pin in GPIO mode" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO35" description="Defines direction for this pin in GPIO mode" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO36" description="Defines direction for this pin in GPIO mode" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO37" description="Defines direction for this pin in GPIO mode" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO38" description="Defines direction for this pin in GPIO mode" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO39" description="Defines direction for this pin in GPIO mode" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO40" description="Defines direction for this pin in GPIO mode" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO41" description="Defines direction for this pin in GPIO mode" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO42" description="Defines direction for this pin in GPIO mode" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO43" description="Defines direction for this pin in GPIO mode" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO44" description="Defines direction for this pin in GPIO mode" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO45" description="Defines direction for this pin in GPIO mode" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO46" description="Defines direction for this pin in GPIO mode" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO47" description="Defines direction for this pin in GPIO mode" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO48" description="Defines direction for this pin in GPIO mode" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO49" description="Defines direction for this pin in GPIO mode" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO50" description="Defines direction for this pin in GPIO mode" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO51" description="Defines direction for this pin in GPIO mode" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO52" description="Defines direction for this pin in GPIO mode" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO53" description="Defines direction for this pin in GPIO mode" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO54" description="Defines direction for this pin in GPIO mode" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO55" description="Defines direction for this pin in GPIO mode" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO56" description="Defines direction for this pin in GPIO mode" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO57" description="Defines direction for this pin in GPIO mode" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO58" description="Defines direction for this pin in GPIO mode" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO59" description="Defines direction for this pin in GPIO mode" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO60" description="Defines direction for this pin in GPIO mode" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO61" description="Defines direction for this pin in GPIO mode" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO62" description="Defines direction for this pin in GPIO mode" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO63" description="Defines direction for this pin in GPIO mode" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
