droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xs_gpio_ctrl_regs.xml
	<register id="GPBCSEL4" width="32" page="1" offset="0x6e" internal="0" description="GPIO B Core Select Register (GPIO56 to 63)">
		<bitfield id="GPIO56" description="GPIO56 Master CPU Select" begin="3" end="0" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO57" description="GPIO57 Master CPU Select" begin="7" end="4" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO58" description="GPIO58 Master CPU Select" begin="11" end="8" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO59" description="GPIO59 Master CPU Select" begin="15" end="12" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO60" description="GPIO60 Master CPU Select" begin="19" end="16" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO61" description="GPIO61 Master CPU Select" begin="23" end="20" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO62" description="GPIO62 Master CPU Select" begin="27" end="24" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO63" description="GPIO63 Master CPU Select" begin="31" end="28" width="4" rwaccess="R/W"/>
	</register>
	<register id="GPBLOCK" width="32" page="1" offset="0x7c" internal="0" description="GPIO B Lock Configuration Register (GPIO32 to 63)">
		<bitfield id="GPIO32" description="Configuration Lock bit for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO33" description="Configuration Lock bit for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO34" description="Configuration Lock bit for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO35" description="Configuration Lock bit for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO36" description="Configuration Lock bit for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO37" description="Configuration Lock bit for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO38" description="Configuration Lock bit for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO39" description="Configuration Lock bit for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO40" description="Configuration Lock bit for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO41" description="Configuration Lock bit for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO42" description="Configuration Lock bit for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO43" description="Configuration Lock bit for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO44" description="Configuration Lock bit for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO45" description="Configuration Lock bit for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO46" description="Configuration Lock bit for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO47" description="Configuration Lock bit for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO48" description="Configuration Lock bit for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO49" description="Configuration Lock bit for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO50" description="Configuration Lock bit for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO51" description="Configuration Lock bit for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO52" description="Configuration Lock bit for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO53" description="Configuration Lock bit for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO54" description="Configuration Lock bit for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO55" description="Configuration Lock bit for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO56" description="Configuration Lock bit for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO57" description="Configuration Lock bit for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO58" description="Configuration Lock bit for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO59" description="Configuration Lock bit for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO60" description="Configuration Lock bit for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO61" description="Configuration Lock bit for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO62" description="Configuration Lock bit for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO63" description="Configuration Lock bit for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="GPBCR" width="32" page="1" offset="0x7e" internal="0" description="GPIO B Lock Commit Register (GPIO32 to 63)">
		<bitfield id="GPIO32" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO33" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO34" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO35" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO36" description="Configuration lock commit bit for this pin" begin="4" end="4" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO37" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO38" description="Configuration lock commit bit for this pin" begin="6" end="6" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO39" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO40" description="Configuration lock commit bit for this pin" begin="8" end="8" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO41" description="Configuration lock commit bit for this pin" begin="9" end="9" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO42" description="Configuration lock commit bit for this pin" begin="10" end="10" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO43" description="Configuration lock commit bit for this pin" begin="11" end="11" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO44" description="Configuration lock commit bit for this pin" begin="12" end="12" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO45" description="Configuration lock commit bit for this pin" begin="13" end="13" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO46" description="Configuration lock commit bit for this pin" begin="14" end="14" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO47" description="Configuration lock commit bit for this pin" begin="15" end="15" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO48" description="Configuration lock commit bit for this pin" begin="16" end="16" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO49" description="Configuration lock commit bit for this pin" begin="17" end="17" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO50" description="Configuration lock commit bit for this pin" begin="18" end="18" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO51" description="Configuration lock commit bit for this pin" begin="19" end="19" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO52" description="Configuration lock commit bit for this pin" begin="20" end="20" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO53" description="Configuration lock commit bit for this pin" begin="21" end="21" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO54" description="Configuration lock commit bit for this pin" begin="22" end="22" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO55" description="Configuration lock commit bit for this pin" begin="23" end="23" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO56" description="Configuration lock commit bit for this pin" begin="24" end="24" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO57" description="Configuration lock commit bit for this pin" begin="25" end="25" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO58" description="Configuration lock commit bit for this pin" begin="26" end="26" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO59" description="Configuration lock commit bit for this pin" begin="27" end="27" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO60" description="Configuration lock commit bit for this pin" begin="28" end="28" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO61" description="Configuration lock commit bit for this pin" begin="29" end="29" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO62" description="Configuration lock commit bit for this pin" begin="30" end="30" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO63" description="Configuration lock commit bit for this pin" begin="31" end="31" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="GPCCTRL" width="32" page="1" offset="0x80" internal="0" description="GPIO C Qualification Sampling Period Control (GPIO64 to 95)">
		<bitfield id="QUALPRD0" description="Qualification sampling period for GPIO64 to GPIO71" begin="7" end="0" width="8" rwaccess="R/W"/>
		<bitfield id="QUALPRD1" description="Qualification sampling period for GPIO72 to GPIO79" begin="15" end="8" width="8" rwaccess="R/W"/>
		<bitfield id="QUALPRD2" description="Qualification sampling period for GPIO80 to GPIO87" begin="23" end="16" width="8" rwaccess="R/W"/>
		<bitfield id="QUALPRD3" description="Qualification sampling period for GPIO88 to GPIO95" begin="31" end="24" width="8" rwaccess="R/W"/>
	</register>
