droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xs_gpio_ctrl_regs.xml
	<register id="GPCINV" width="32" page="1" offset="0x90" internal="0" description="GPIO C Input Polarity Invert Registers (GPIO64 to 95)">
		<bitfield id="GPIO64" description="Input inversion control for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO65" description="Input inversion control for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO66" description="Input inversion control for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO67" description="Input inversion control for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO68" description="Input inversion control for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO69" description="Input inversion control for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO70" description="Input inversion control for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO71" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO72" description="Input inversion control for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO73" description="Input inversion control for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO74" description="Input inversion control for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO75" description="Input inversion control for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO76" description="Input inversion control for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO77" description="Input inversion control for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO78" description="Input inversion control for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO79" description="Input inversion control for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO80" description="Input inversion control for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO81" description="Input inversion control for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO82" description="Input inversion control for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO83" description="Input inversion control for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO84" description="Input inversion control for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO85" description="Input inversion control for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO86" description="Input inversion control for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO87" description="Input inversion control for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO88" description="Input inversion control for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO89" description="Input inversion control for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO90" description="Input inversion control for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO91" description="Input inversion control for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO92" description="Input inversion control for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO93" description="Input inversion control for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO94" description="Input inversion control for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO95" description="Input inversion control for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="GPCODR" width="32" page="1" offset="0x92" internal="0" description="GPIO C Open Drain Output Register (GPIO64 to GPIO95)">
		<bitfield id="GPIO64" description="Outpout Open-Drain control for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO65" description="Outpout Open-Drain control for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO66" description="Outpout Open-Drain control for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO67" description="Outpout Open-Drain control for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO68" description="Outpout Open-Drain control for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO69" description="Outpout Open-Drain control for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO70" description="Outpout Open-Drain control for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO71" description="Outpout Open-Drain control for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO72" description="Outpout Open-Drain control for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO73" description="Outpout Open-Drain control for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO74" description="Outpout Open-Drain control for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO75" description="Outpout Open-Drain control for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO76" description="Outpout Open-Drain control for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO77" description="Outpout Open-Drain control for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO78" description="Outpout Open-Drain control for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO79" description="Outpout Open-Drain control for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO80" description="Outpout Open-Drain control for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO81" description="Outpout Open-Drain control for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO82" description="Outpout Open-Drain control for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO83" description="Outpout Open-Drain control for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO84" description="Outpout Open-Drain control for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO85" description="Outpout Open-Drain control for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO86" description="Outpout Open-Drain control for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO87" description="Outpout Open-Drain control for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO88" description="Outpout Open-Drain control for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO89" description="Outpout Open-Drain control for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO90" description="Outpout Open-Drain control for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO91" description="Outpout Open-Drain control for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO92" description="Outpout Open-Drain control for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO93" description="Outpout Open-Drain control for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO94" description="Outpout Open-Drain control for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO95" description="Outpout Open-Drain control for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="GPCGMUX1" width="32" page="1" offset="0xa0" internal="0" description="GPIO C Peripheral Group Mux (GPIO64 to 79)">
		<bitfield id="GPIO64" description="Defines pin-muxing selection for GPIO64" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO65" description="Defines pin-muxing selection for GPIO65" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO66" description="Defines pin-muxing selection for GPIO66" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO67" description="Defines pin-muxing selection for GPIO67" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO68" description="Defines pin-muxing selection for GPIO68" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO69" description="Defines pin-muxing selection for GPIO69" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO70" description="Defines pin-muxing selection for GPIO70" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO71" description="Defines pin-muxing selection for GPIO71" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO72" description="Defines pin-muxing selection for GPIO72" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO73" description="Defines pin-muxing selection for GPIO73" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO74" description="Defines pin-muxing selection for GPIO74" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO75" description="Defines pin-muxing selection for GPIO75" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO76" description="Defines pin-muxing selection for GPIO76" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO77" description="Defines pin-muxing selection for GPIO77" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO78" description="Defines pin-muxing selection for GPIO78" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO79" description="Defines pin-muxing selection for GPIO79" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
	<register id="GPCGMUX2" width="32" page="1" offset="0xa2" internal="0" description="GPIO C Peripheral Group Mux (GPIO80  to 95)">
		<bitfield id="GPIO80" description="Defines pin-muxing selection for GPIO80" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO81" description="Defines pin-muxing selection for GPIO81" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO82" description="Defines pin-muxing selection for GPIO82" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO83" description="Defines pin-muxing selection for GPIO83" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO84" description="Defines pin-muxing selection for GPIO84" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO85" description="Defines pin-muxing selection for GPIO85" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO86" description="Defines pin-muxing selection for GPIO86" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO87" description="Defines pin-muxing selection for GPIO87" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO88" description="Defines pin-muxing selection for GPIO88" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO89" description="Defines pin-muxing selection for GPIO89" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO90" description="Defines pin-muxing selection for GPIO90" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO91" description="Defines pin-muxing selection for GPIO91" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO92" description="Defines pin-muxing selection for GPIO92" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO93" description="Defines pin-muxing selection for GPIO93" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO94" description="Defines pin-muxing selection for GPIO94" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO95" description="Defines pin-muxing selection for GPIO95" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
	<register id="GPCCSEL1" width="32" page="1" offset="0xa8" internal="0" description="GPIO C Core Select Register (GPIO64 to 71)">
		<bitfield id="GPIO64" description="GPIO64 Master CPU Select" begin="3" end="0" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO65" description="GPIO65 Master CPU Select" begin="7" end="4" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO66" description="GPIO66 Master CPU Select" begin="11" end="8" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO67" description="GPIO67 Master CPU Select" begin="15" end="12" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO68" description="GPIO68 Master CPU Select" begin="19" end="16" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO69" description="GPIO69 Master CPU Select" begin="23" end="20" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO70" description="GPIO70 Master CPU Select" begin="27" end="24" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO71" description="GPIO71 Master CPU Select" begin="31" end="28" width="4" rwaccess="R/W"/>
	</register>
	<register id="GPCCSEL2" width="32" page="1" offset="0xaa" internal="0" description="GPIO C Core Select Register (GPIO72 to 79)">
		<bitfield id="GPIO72" description="GPIO72 Master CPU Select" begin="3" end="0" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO73" description="GPIO73 Master CPU Select" begin="7" end="4" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO74" description="GPIO74 Master CPU Select" begin="11" end="8" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO75" description="GPIO75 Master CPU Select" begin="15" end="12" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO76" description="GPIO76 Master CPU Select" begin="19" end="16" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO77" description="GPIO77 Master CPU Select" begin="23" end="20" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO78" description="GPIO78 Master CPU Select" begin="27" end="24" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO79" description="GPIO79 Master CPU Select" begin="31" end="28" width="4" rwaccess="R/W"/>
	</register>
	<register id="GPCCSEL3" width="32" page="1" offset="0xac" internal="0" description="GPIO C Core Select Register (GPIO80  to 87)">
		<bitfield id="GPIO80" description="GPIO80 Master CPU Select" begin="3" end="0" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO81" description="GPIO81 Master CPU Select" begin="7" end="4" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO82" description="GPIO82 Master CPU Select" begin="11" end="8" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO83" description="GPIO83 Master CPU Select" begin="15" end="12" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO84" description="GPIO84 Master CPU Select" begin="19" end="16" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO85" description="GPIO85 Master CPU Select" begin="23" end="20" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO86" description="GPIO86 Master CPU Select" begin="27" end="24" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO87" description="GPIO87 Master CPU Select" begin="31" end="28" width="4" rwaccess="R/W"/>
	</register>
	<register id="GPCCSEL4" width="32" page="1" offset="0xae" internal="0" description="GPIO C Core Select Register (GPIO88 to 95)">
		<bitfield id="GPIO88" description="GPIO88 Master CPU Select" begin="3" end="0" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO89" description="GPIO89 Master CPU Select" begin="7" end="4" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO90" description="GPIO90 Master CPU Select" begin="11" end="8" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO91" description="GPIO91 Master CPU Select" begin="15" end="12" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO92" description="GPIO92 Master CPU Select" begin="19" end="16" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO93" description="GPIO93 Master CPU Select" begin="23" end="20" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO94" description="GPIO94 Master CPU Select" begin="27" end="24" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO95" description="GPIO95 Master CPU Select" begin="31" end="28" width="4" rwaccess="R/W"/>
	</register>
	<register id="GPCLOCK" width="32" page="1" offset="0xbc" internal="0" description="GPIO C Lock Configuration Register (GPIO64 to 95)">
		<bitfield id="GPIO64" description="Configuration Lock bit for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO65" description="Configuration Lock bit for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO66" description="Configuration Lock bit for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO67" description="Configuration Lock bit for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO68" description="Configuration Lock bit for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO69" description="Configuration Lock bit for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO70" description="Configuration Lock bit for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO71" description="Configuration Lock bit for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO72" description="Configuration Lock bit for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO73" description="Configuration Lock bit for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO74" description="Configuration Lock bit for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO75" description="Configuration Lock bit for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO76" description="Configuration Lock bit for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO77" description="Configuration Lock bit for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO78" description="Configuration Lock bit for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO79" description="Configuration Lock bit for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO80" description="Configuration Lock bit for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO81" description="Configuration Lock bit for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO82" description="Configuration Lock bit for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO83" description="Configuration Lock bit for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO84" description="Configuration Lock bit for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO85" description="Configuration Lock bit for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO86" description="Configuration Lock bit for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO87" description="Configuration Lock bit for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO88" description="Configuration Lock bit for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO89" description="Configuration Lock bit for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO90" description="Configuration Lock bit for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO91" description="Configuration Lock bit for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO92" description="Configuration Lock bit for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO93" description="Configuration Lock bit for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO94" description="Configuration Lock bit for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO95" description="Configuration Lock bit for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
