droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xs_gpio_ctrl_regs.xml
	<register id="GPDQSEL2" width="32" page="1" offset="0xc4" internal="0" description="GPIO D Qualifier Select 2 Register (GPIO112 to 127)">
		<bitfield id="GPIO112" description="Select input qualification type for GPIO112" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO113" description="Select input qualification type for GPIO113" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO114" description="Select input qualification type for GPIO114" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO115" description="Select input qualification type for GPIO115" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO116" description="Select input qualification type for GPIO116" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO117" description="Select input qualification type for GPIO117" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO118" description="Select input qualification type for GPIO118" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO119" description="Select input qualification type for GPIO119" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO120" description="Select input qualification type for GPIO120" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO121" description="Select input qualification type for GPIO121" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO122" description="Select input qualification type for GPIO122" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO123" description="Select input qualification type for GPIO123" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO124" description="Select input qualification type for GPIO124" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO125" description="Select input qualification type for GPIO125" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO126" description="Select input qualification type for GPIO126" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO127" description="Select input qualification type for GPIO127" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
	<register id="GPDMUX1" width="32" page="1" offset="0xc6" internal="0" description="GPIO D Mux 1 Register (GPIO96 to 111)">
		<bitfield id="GPIO96" description="Defines pin-muxing selection for GPIO96" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO97" description="Defines pin-muxing selection for GPIO97" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO98" description="Defines pin-muxing selection for GPIO98" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO99" description="Defines pin-muxing selection for GPIO99" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO100" description="Defines pin-muxing selection for GPIO100" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO101" description="Defines pin-muxing selection for GPIO101" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO102" description="Defines pin-muxing selection for GPIO102" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO103" description="Defines pin-muxing selection for GPIO103" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO104" description="Defines pin-muxing selection for GPIO104" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO105" description="Defines pin-muxing selection for GPIO105" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO106" description="Defines pin-muxing selection for GPIO106" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO107" description="Defines pin-muxing selection for GPIO107" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO108" description="Defines pin-muxing selection for GPIO108" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO109" description="Defines pin-muxing selection for GPIO109" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO110" description="Defines pin-muxing selection for GPIO110" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO111" description="Defines pin-muxing selection for GPIO111" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
	<register id="GPDMUX2" width="32" page="1" offset="0xc8" internal="0" description="GPIO D Mux 2 Register (GPIO112 to 127)">
		<bitfield id="GPIO112" description="Defines pin-muxing selection for GPIO112" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO113" description="Defines pin-muxing selection for GPIO113" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO114" description="Defines pin-muxing selection for GPIO114" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO115" description="Defines pin-muxing selection for GPIO115" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO116" description="Defines pin-muxing selection for GPIO116" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO117" description="Defines pin-muxing selection for GPIO117" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO118" description="Defines pin-muxing selection for GPIO118" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO119" description="Defines pin-muxing selection for GPIO119" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO120" description="Defines pin-muxing selection for GPIO120" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO121" description="Defines pin-muxing selection for GPIO121" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO122" description="Defines pin-muxing selection for GPIO122" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO123" description="Defines pin-muxing selection for GPIO123" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO124" description="Defines pin-muxing selection for GPIO124" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO125" description="Defines pin-muxing selection for GPIO125" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO126" description="Defines pin-muxing selection for GPIO126" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO127" description="Defines pin-muxing selection for GPIO127" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
	<register id="GPDDIR" width="32" page="1" offset="0xca" internal="0" description="GPIO D Direction Register (GPIO96 to 127)">
		<bitfield id="GPIO96" description="Defines direction for this pin in GPIO mode" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO97" description="Defines direction for this pin in GPIO mode" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO98" description="Defines direction for this pin in GPIO mode" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO99" description="Defines direction for this pin in GPIO mode" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO100" description="Defines direction for this pin in GPIO mode" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO101" description="Defines direction for this pin in GPIO mode" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO102" description="Defines direction for this pin in GPIO mode" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO103" description="Defines direction for this pin in GPIO mode" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO104" description="Defines direction for this pin in GPIO mode" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO105" description="Defines direction for this pin in GPIO mode" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO106" description="Defines direction for this pin in GPIO mode" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO107" description="Defines direction for this pin in GPIO mode" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO108" description="Defines direction for this pin in GPIO mode" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO109" description="Defines direction for this pin in GPIO mode" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO110" description="Defines direction for this pin in GPIO mode" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO111" description="Defines direction for this pin in GPIO mode" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO112" description="Defines direction for this pin in GPIO mode" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO113" description="Defines direction for this pin in GPIO mode" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO114" description="Defines direction for this pin in GPIO mode" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO115" description="Defines direction for this pin in GPIO mode" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO116" description="Defines direction for this pin in GPIO mode" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO117" description="Defines direction for this pin in GPIO mode" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO118" description="Defines direction for this pin in GPIO mode" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO119" description="Defines direction for this pin in GPIO mode" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO120" description="Defines direction for this pin in GPIO mode" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO121" description="Defines direction for this pin in GPIO mode" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO122" description="Defines direction for this pin in GPIO mode" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO123" description="Defines direction for this pin in GPIO mode" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO124" description="Defines direction for this pin in GPIO mode" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO125" description="Defines direction for this pin in GPIO mode" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO126" description="Defines direction for this pin in GPIO mode" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO127" description="Defines direction for this pin in GPIO mode" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="GPDPUD" width="32" page="1" offset="0xcc" internal="0" description="GPIO D Pull Up Disable Register (GPIO96 to 127) ">
		<bitfield id="GPIO96" description="Pull-Up Disable control for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO97" description="Pull-Up Disable control for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO98" description="Pull-Up Disable control for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO99" description="Pull-Up Disable control for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO100" description="Pull-Up Disable control for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO101" description="Pull-Up Disable control for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO102" description="Pull-Up Disable control for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO103" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO104" description="Pull-Up Disable control for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO105" description="Pull-Up Disable control for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO106" description="Pull-Up Disable control for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO107" description="Pull-Up Disable control for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO108" description="Pull-Up Disable control for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO109" description="Pull-Up Disable control for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO110" description="Pull-Up Disable control for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO111" description="Pull-Up Disable control for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO112" description="Pull-Up Disable control for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO113" description="Pull-Up Disable control for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO114" description="Pull-Up Disable control for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO115" description="Pull-Up Disable control for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO116" description="Pull-Up Disable control for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO117" description="Pull-Up Disable control for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO118" description="Pull-Up Disable control for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO119" description="Pull-Up Disable control for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO120" description="Pull-Up Disable control for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO121" description="Pull-Up Disable control for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO122" description="Pull-Up Disable control for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO123" description="Pull-Up Disable control for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO124" description="Pull-Up Disable control for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO125" description="Pull-Up Disable control for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO126" description="Pull-Up Disable control for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO127" description="Pull-Up Disable control for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="GPDINV" width="32" page="1" offset="0xd0" internal="0" description="GPIO D Input Polarity Invert Registers (GPIO96 to 127)">
		<bitfield id="GPIO96" description="Input inversion control for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO97" description="Input inversion control for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO98" description="Input inversion control for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO99" description="Input inversion control for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO100" description="Input inversion control for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO101" description="Input inversion control for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO102" description="Input inversion control for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO103" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO104" description="Input inversion control for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO105" description="Input inversion control for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO106" description="Input inversion control for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO107" description="Input inversion control for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO108" description="Input inversion control for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO109" description="Input inversion control for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO110" description="Input inversion control for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO111" description="Input inversion control for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO112" description="Input inversion control for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO113" description="Input inversion control for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO114" description="Input inversion control for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO115" description="Input inversion control for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO116" description="Input inversion control for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO117" description="Input inversion control for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO118" description="Input inversion control for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO119" description="Input inversion control for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO120" description="Input inversion control for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO121" description="Input inversion control for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO122" description="Input inversion control for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO123" description="Input inversion control for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO124" description="Input inversion control for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO125" description="Input inversion control for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO126" description="Input inversion control for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO127" description="Input inversion control for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="GPDODR" width="32" page="1" offset="0xd2" internal="0" description="GPIO D Open Drain Output Register (GPIO96 to GPIO127)">
		<bitfield id="GPIO96" description="Outpout Open-Drain control for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO97" description="Outpout Open-Drain control for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO98" description="Outpout Open-Drain control for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO99" description="Outpout Open-Drain control for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO100" description="Outpout Open-Drain control for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO101" description="Outpout Open-Drain control for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO102" description="Outpout Open-Drain control for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO103" description="Outpout Open-Drain control for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO104" description="Outpout Open-Drain control for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO105" description="Outpout Open-Drain control for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO106" description="Outpout Open-Drain control for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO107" description="Outpout Open-Drain control for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO108" description="Outpout Open-Drain control for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO109" description="Outpout Open-Drain control for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO110" description="Outpout Open-Drain control for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO111" description="Outpout Open-Drain control for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO112" description="Outpout Open-Drain control for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO113" description="Outpout Open-Drain control for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO114" description="Outpout Open-Drain control for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO115" description="Outpout Open-Drain control for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO116" description="Outpout Open-Drain control for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO117" description="Outpout Open-Drain control for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO118" description="Outpout Open-Drain control for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO119" description="Outpout Open-Drain control for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO120" description="Outpout Open-Drain control for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO121" description="Outpout Open-Drain control for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO122" description="Outpout Open-Drain control for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO123" description="Outpout Open-Drain control for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO124" description="Outpout Open-Drain control for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO125" description="Outpout Open-Drain control for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO126" description="Outpout Open-Drain control for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO127" description="Outpout Open-Drain control for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
