droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xs_gpio_ctrl_regs.xml
	<register id="GPDGMUX1" width="32" page="1" offset="0xe0" internal="0" description="GPIO D Peripheral Group Mux (GPIO96 to 111)">
		<bitfield id="GPIO96" description="Defines pin-muxing selection for GPIO96" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO97" description="Defines pin-muxing selection for GPIO97" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO98" description="Defines pin-muxing selection for GPIO98" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO99" description="Defines pin-muxing selection for GPIO99" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO100" description="Defines pin-muxing selection for GPIO100" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO101" description="Defines pin-muxing selection for GPIO101" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO102" description="Defines pin-muxing selection for GPIO102" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO103" description="Defines pin-muxing selection for GPIO103" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO104" description="Defines pin-muxing selection for GPIO104" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO105" description="Defines pin-muxing selection for GPIO105" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO106" description="Defines pin-muxing selection for GPIO106" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO107" description="Defines pin-muxing selection for GPIO107" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO108" description="Defines pin-muxing selection for GPIO108" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO109" description="Defines pin-muxing selection for GPIO109" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO110" description="Defines pin-muxing selection for GPIO110" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO111" description="Defines pin-muxing selection for GPIO111" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
	<register id="GPDGMUX2" width="32" page="1" offset="0xe2" internal="0" description="GPIO D Peripheral Group Mux (GPIO112 to 127)">
		<bitfield id="GPIO112" description="Defines pin-muxing selection for GPIO112" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO113" description="Defines pin-muxing selection for GPIO113" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO114" description="Defines pin-muxing selection for GPIO114" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO115" description="Defines pin-muxing selection for GPIO115" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO116" description="Defines pin-muxing selection for GPIO116" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO117" description="Defines pin-muxing selection for GPIO117" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO118" description="Defines pin-muxing selection for GPIO118" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO119" description="Defines pin-muxing selection for GPIO119" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO120" description="Defines pin-muxing selection for GPIO120" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO121" description="Defines pin-muxing selection for GPIO121" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO122" description="Defines pin-muxing selection for GPIO122" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO123" description="Defines pin-muxing selection for GPIO123" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO124" description="Defines pin-muxing selection for GPIO124" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO125" description="Defines pin-muxing selection for GPIO125" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO126" description="Defines pin-muxing selection for GPIO126" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO127" description="Defines pin-muxing selection for GPIO127" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
	<register id="GPDCSEL1" width="32" page="1" offset="0xe8" internal="0" description="GPIO D Core Select Register (GPIO96 to 103)">
		<bitfield id="GPIO96" description="GPIO96 Master CPU Select" begin="3" end="0" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO97" description="GPIO97 Master CPU Select" begin="7" end="4" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO98" description="GPIO98 Master CPU Select" begin="11" end="8" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO99" description="GPIO99 Master CPU Select" begin="15" end="12" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO100" description="GPIO100 Master CPU Select" begin="19" end="16" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO101" description="GPIO101 Master CPU Select" begin="23" end="20" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO102" description="GPIO102 Master CPU Select" begin="27" end="24" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO103" description="GPIO103 Master CPU Select" begin="31" end="28" width="4" rwaccess="R/W"/>
	</register>
	<register id="GPDCSEL2" width="32" page="1" offset="0xea" internal="0" description="GPIO D Core Select Register (GPIO104 to 111)">
		<bitfield id="GPIO104" description="GPIO104 Master CPU Select" begin="3" end="0" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO105" description="GPIO105 Master CPU Select" begin="7" end="4" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO106" description="GPIO106 Master CPU Select" begin="11" end="8" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO107" description="GPIO107 Master CPU Select" begin="15" end="12" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO108" description="GPIO108 Master CPU Select" begin="19" end="16" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO109" description="GPIO109 Master CPU Select" begin="23" end="20" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO110" description="GPIO110 Master CPU Select" begin="27" end="24" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO111" description="GPIO111 Master CPU Select" begin="31" end="28" width="4" rwaccess="R/W"/>
	</register>
	<register id="GPDCSEL3" width="32" page="1" offset="0xec" internal="0" description="GPIO D Core Select Register (GPIO112 to 119)">
		<bitfield id="GPIO112" description="GPIO112 Master CPU Select" begin="3" end="0" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO113" description="GPIO113 Master CPU Select" begin="7" end="4" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO114" description="GPIO114 Master CPU Select" begin="11" end="8" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO115" description="GPIO115 Master CPU Select" begin="15" end="12" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO116" description="GPIO116 Master CPU Select" begin="19" end="16" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO117" description="GPIO117 Master CPU Select" begin="23" end="20" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO118" description="GPIO118 Master CPU Select" begin="27" end="24" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO119" description="GPIO119 Master CPU Select" begin="31" end="28" width="4" rwaccess="R/W"/>
	</register>
	<register id="GPDCSEL4" width="32" page="1" offset="0xee" internal="0" description="GPIO D Core Select Register (GPIO120 to 127)">
		<bitfield id="GPIO120" description="GPIO120 Master CPU Select" begin="3" end="0" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO121" description="GPIO121 Master CPU Select" begin="7" end="4" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO122" description="GPIO122 Master CPU Select" begin="11" end="8" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO123" description="GPIO123 Master CPU Select" begin="15" end="12" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO124" description="GPIO124 Master CPU Select" begin="19" end="16" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO125" description="GPIO125 Master CPU Select" begin="23" end="20" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO126" description="GPIO126 Master CPU Select" begin="27" end="24" width="4" rwaccess="R/W"/>
		<bitfield id="GPIO127" description="GPIO127 Master CPU Select" begin="31" end="28" width="4" rwaccess="R/W"/>
	</register>
