droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xs_gpio_ctrl_regs.xml
	<register id="GPDLOCK" width="32" page="1" offset="0xfc" internal="0" description="GPIO D Lock Configuration Register (GPIO96 to 127)">
		<bitfield id="GPIO96" description="Configuration Lock bit for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO97" description="Configuration Lock bit for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO98" description="Configuration Lock bit for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO99" description="Configuration Lock bit for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO100" description="Configuration Lock bit for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO101" description="Configuration Lock bit for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO102" description="Configuration Lock bit for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO103" description="Configuration Lock bit for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO104" description="Configuration Lock bit for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO105" description="Configuration Lock bit for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO106" description="Configuration Lock bit for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO107" description="Configuration Lock bit for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO108" description="Configuration Lock bit for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO109" description="Configuration Lock bit for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO110" description="Configuration Lock bit for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO111" description="Configuration Lock bit for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO112" description="Configuration Lock bit for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO113" description="Configuration Lock bit for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO114" description="Configuration Lock bit for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO115" description="Configuration Lock bit for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO116" description="Configuration Lock bit for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO117" description="Configuration Lock bit for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO118" description="Configuration Lock bit for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO119" description="Configuration Lock bit for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO120" description="Configuration Lock bit for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO121" description="Configuration Lock bit for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO122" description="Configuration Lock bit for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO123" description="Configuration Lock bit for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO124" description="Configuration Lock bit for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO125" description="Configuration Lock bit for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO126" description="Configuration Lock bit for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO127" description="Configuration Lock bit for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="GPDCR" width="32" page="1" offset="0xfe" internal="0" description="GPIO D Lock Commit Register (GPIO96 to 127)">
		<bitfield id="GPIO96" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO97" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO98" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO99" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO100" description="Configuration lock commit bit for this pin" begin="4" end="4" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO101" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO102" description="Configuration lock commit bit for this pin" begin="6" end="6" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO103" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO104" description="Configuration lock commit bit for this pin" begin="8" end="8" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO105" description="Configuration lock commit bit for this pin" begin="9" end="9" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO106" description="Configuration lock commit bit for this pin" begin="10" end="10" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO107" description="Configuration lock commit bit for this pin" begin="11" end="11" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO108" description="Configuration lock commit bit for this pin" begin="12" end="12" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO109" description="Configuration lock commit bit for this pin" begin="13" end="13" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO110" description="Configuration lock commit bit for this pin" begin="14" end="14" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO111" description="Configuration lock commit bit for this pin" begin="15" end="15" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO112" description="Configuration lock commit bit for this pin" begin="16" end="16" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO113" description="Configuration lock commit bit for this pin" begin="17" end="17" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO114" description="Configuration lock commit bit for this pin" begin="18" end="18" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO115" description="Configuration lock commit bit for this pin" begin="19" end="19" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO116" description="Configuration lock commit bit for this pin" begin="20" end="20" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO117" description="Configuration lock commit bit for this pin" begin="21" end="21" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO118" description="Configuration lock commit bit for this pin" begin="22" end="22" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO119" description="Configuration lock commit bit for this pin" begin="23" end="23" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO120" description="Configuration lock commit bit for this pin" begin="24" end="24" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO121" description="Configuration lock commit bit for this pin" begin="25" end="25" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO122" description="Configuration lock commit bit for this pin" begin="26" end="26" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO123" description="Configuration lock commit bit for this pin" begin="27" end="27" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO124" description="Configuration lock commit bit for this pin" begin="28" end="28" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO125" description="Configuration lock commit bit for this pin" begin="29" end="29" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO126" description="Configuration lock commit bit for this pin" begin="30" end="30" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GPIO127" description="Configuration lock commit bit for this pin" begin="31" end="31" width="1" rwaccess="R/WOnce"/>
	</register>
