droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xs_gpio_ctrl_regs.xml
	<register id="GPECTRL" width="32" page="1" offset="0x100" internal="0" description="GPIO E Qualification Sampling Period Control (GPIO128 to 159)">
		<bitfield id="QUALPRD0" description="Qualification sampling period for GPIO128 to GPIO135" begin="7" end="0" width="8" rwaccess="R/W"/>
		<bitfield id="QUALPRD1" description="Qualification sampling period for GPIO136 to GPIO143" begin="15" end="8" width="8" rwaccess="R/W"/>
		<bitfield id="QUALPRD2" description="Qualification sampling period for GPIO144 to GPIO151" begin="23" end="16" width="8" rwaccess="R/W"/>
		<bitfield id="QUALPRD3" description="Qualification sampling period for GPIO152 to GPIO159" begin="31" end="24" width="8" rwaccess="R/W"/>
	</register>
	<register id="GPEQSEL1" width="32" page="1" offset="0x102" internal="0" description="GPIO E Qualifier Select 1 Register (GPIO128 to 143)">
		<bitfield id="GPIO128" description="Select input qualification type for GPIO128" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO129" description="Select input qualification type for GPIO129" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO130" description="Select input qualification type for GPIO130" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO131" description="Select input qualification type for GPIO131" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO132" description="Select input qualification type for GPIO132" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO133" description="Select input qualification type for GPIO133" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO134" description="Select input qualification type for GPIO134" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO135" description="Select input qualification type for GPIO135" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO136" description="Select input qualification type for GPIO136" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO137" description="Select input qualification type for GPIO137" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO138" description="Select input qualification type for GPIO138" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO139" description="Select input qualification type for GPIO139" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO140" description="Select input qualification type for GPIO140" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO141" description="Select input qualification type for GPIO141" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO142" description="Select input qualification type for GPIO142" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO143" description="Select input qualification type for GPIO143" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
	<register id="GPEQSEL2" width="32" page="1" offset="0x104" internal="0" description="GPIO E Qualifier Select 2 Register (GPIO144  to 159)">
		<bitfield id="GPIO144" description="Select input qualification type for GPIO144" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO145" description="Select input qualification type for GPIO145" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO146" description="Select input qualification type for GPIO146" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO147" description="Select input qualification type for GPIO147" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO148" description="Select input qualification type for GPIO148" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO149" description="Select input qualification type for GPIO149" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO150" description="Select input qualification type for GPIO150" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO151" description="Select input qualification type for GPIO151" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO152" description="Select input qualification type for GPIO152" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO153" description="Select input qualification type for GPIO153" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO154" description="Select input qualification type for GPIO154" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO155" description="Select input qualification type for GPIO155" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO156" description="Select input qualification type for GPIO156" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO157" description="Select input qualification type for GPIO157" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO158" description="Select input qualification type for GPIO158" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO159" description="Select input qualification type for GPIO159" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
	<register id="GPEMUX1" width="32" page="1" offset="0x106" internal="0" description="GPIO E Mux 1 Register (GPIO128 to 143)">
		<bitfield id="GPIO128" description="Defines pin-muxing selection for GPIO128" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO129" description="Defines pin-muxing selection for GPIO129" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO130" description="Defines pin-muxing selection for GPIO130" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO131" description="Defines pin-muxing selection for GPIO131" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO132" description="Defines pin-muxing selection for GPIO132" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO133" description="Defines pin-muxing selection for GPIO133" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO134" description="Defines pin-muxing selection for GPIO134" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO135" description="Defines pin-muxing selection for GPIO135" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO136" description="Defines pin-muxing selection for GPIO136" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO137" description="Defines pin-muxing selection for GPIO137" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO138" description="Defines pin-muxing selection for GPIO138" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO139" description="Defines pin-muxing selection for GPIO139" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO140" description="Defines pin-muxing selection for GPIO140" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO141" description="Defines pin-muxing selection for GPIO141" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO142" description="Defines pin-muxing selection for GPIO142" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO143" description="Defines pin-muxing selection for GPIO143" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
	<register id="GPEMUX2" width="32" page="1" offset="0x108" internal="0" description="GPIO E Mux 2 Register (GPIO144  to 159)">
		<bitfield id="GPIO144" description="Defines pin-muxing selection for GPIO144" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO145" description="Defines pin-muxing selection for GPIO145" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO146" description="Defines pin-muxing selection for GPIO146" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO147" description="Defines pin-muxing selection for GPIO147" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO148" description="Defines pin-muxing selection for GPIO148" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO149" description="Defines pin-muxing selection for GPIO149" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO150" description="Defines pin-muxing selection for GPIO150" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO151" description="Defines pin-muxing selection for GPIO151" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO152" description="Defines pin-muxing selection for GPIO152" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO153" description="Defines pin-muxing selection for GPIO153" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO154" description="Defines pin-muxing selection for GPIO154" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO155" description="Defines pin-muxing selection for GPIO155" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO156" description="Defines pin-muxing selection for GPIO156" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO157" description="Defines pin-muxing selection for GPIO157" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO158" description="Defines pin-muxing selection for GPIO158" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO159" description="Defines pin-muxing selection for GPIO159" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
	<register id="GPEDIR" width="32" page="1" offset="0x10a" internal="0" description="GPIO E Direction Register (GPIO128 to 159)">
		<bitfield id="GPIO128" description="Defines direction for this pin in GPIO mode" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO129" description="Defines direction for this pin in GPIO mode" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO130" description="Defines direction for this pin in GPIO mode" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO131" description="Defines direction for this pin in GPIO mode" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO132" description="Defines direction for this pin in GPIO mode" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO133" description="Defines direction for this pin in GPIO mode" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO134" description="Defines direction for this pin in GPIO mode" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO135" description="Defines direction for this pin in GPIO mode" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO136" description="Defines direction for this pin in GPIO mode" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO137" description="Defines direction for this pin in GPIO mode" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO138" description="Defines direction for this pin in GPIO mode" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO139" description="Defines direction for this pin in GPIO mode" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO140" description="Defines direction for this pin in GPIO mode" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO141" description="Defines direction for this pin in GPIO mode" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO142" description="Defines direction for this pin in GPIO mode" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO143" description="Defines direction for this pin in GPIO mode" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO144" description="Defines direction for this pin in GPIO mode" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO145" description="Defines direction for this pin in GPIO mode" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO146" description="Defines direction for this pin in GPIO mode" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO147" description="Defines direction for this pin in GPIO mode" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO148" description="Defines direction for this pin in GPIO mode" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO149" description="Defines direction for this pin in GPIO mode" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO150" description="Defines direction for this pin in GPIO mode" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO151" description="Defines direction for this pin in GPIO mode" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO152" description="Defines direction for this pin in GPIO mode" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO153" description="Defines direction for this pin in GPIO mode" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO154" description="Defines direction for this pin in GPIO mode" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO155" description="Defines direction for this pin in GPIO mode" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO156" description="Defines direction for this pin in GPIO mode" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO157" description="Defines direction for this pin in GPIO mode" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO158" description="Defines direction for this pin in GPIO mode" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO159" description="Defines direction for this pin in GPIO mode" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="GPEPUD" width="32" page="1" offset="0x10c" internal="0" description="GPIO E Pull Up Disable Register (GPIO128 to 159) ">
		<bitfield id="GPIO128" description="Pull-Up Disable control for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO129" description="Pull-Up Disable control for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO130" description="Pull-Up Disable control for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO131" description="Pull-Up Disable control for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO132" description="Pull-Up Disable control for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO133" description="Pull-Up Disable control for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO134" description="Pull-Up Disable control for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO135" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO136" description="Pull-Up Disable control for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO137" description="Pull-Up Disable control for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO138" description="Pull-Up Disable control for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO139" description="Pull-Up Disable control for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO140" description="Pull-Up Disable control for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO141" description="Pull-Up Disable control for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO142" description="Pull-Up Disable control for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO143" description="Pull-Up Disable control for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO144" description="Pull-Up Disable control for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO145" description="Pull-Up Disable control for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO146" description="Pull-Up Disable control for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO147" description="Pull-Up Disable control for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO148" description="Pull-Up Disable control for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO149" description="Pull-Up Disable control for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO150" description="Pull-Up Disable control for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO151" description="Pull-Up Disable control for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO152" description="Pull-Up Disable control for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO153" description="Pull-Up Disable control for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO154" description="Pull-Up Disable control for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO155" description="Pull-Up Disable control for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO156" description="Pull-Up Disable control for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO157" description="Pull-Up Disable control for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO158" description="Pull-Up Disable control for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO159" description="Pull-Up Disable control for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="GPEINV" width="32" page="1" offset="0x110" internal="0" description="GPIO E Input Polarity Invert Registers (GPIO128 to 159)">
		<bitfield id="GPIO128" description="Input inversion control for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO129" description="Input inversion control for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO130" description="Input inversion control for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO131" description="Input inversion control for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO132" description="Input inversion control for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO133" description="Input inversion control for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO134" description="Input inversion control for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO135" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO136" description="Input inversion control for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO137" description="Input inversion control for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO138" description="Input inversion control for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO139" description="Input inversion control for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO140" description="Input inversion control for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO141" description="Input inversion control for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO142" description="Input inversion control for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO143" description="Input inversion control for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO144" description="Input inversion control for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO145" description="Input inversion control for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO146" description="Input inversion control for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO147" description="Input inversion control for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO148" description="Input inversion control for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO149" description="Input inversion control for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO150" description="Input inversion control for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO151" description="Input inversion control for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO152" description="Input inversion control for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO153" description="Input inversion control for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO154" description="Input inversion control for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO155" description="Input inversion control for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO156" description="Input inversion control for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO157" description="Input inversion control for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO158" description="Input inversion control for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO159" description="Input inversion control for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
