droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xs_gpio_ctrl_regs.xml
	<register id="GPEODR" width="32" page="1" offset="0x112" internal="0" description="GPIO E Open Drain Output Register (GPIO128 to GPIO159)">
		<bitfield id="GPIO128" description="Outpout Open-Drain control for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO129" description="Outpout Open-Drain control for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO130" description="Outpout Open-Drain control for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO131" description="Outpout Open-Drain control for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO132" description="Outpout Open-Drain control for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO133" description="Outpout Open-Drain control for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO134" description="Outpout Open-Drain control for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO135" description="Outpout Open-Drain control for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO136" description="Outpout Open-Drain control for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO137" description="Outpout Open-Drain control for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO138" description="Outpout Open-Drain control for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO139" description="Outpout Open-Drain control for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO140" description="Outpout Open-Drain control for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO141" description="Outpout Open-Drain control for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO142" description="Outpout Open-Drain control for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO143" description="Outpout Open-Drain control for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO144" description="Outpout Open-Drain control for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO145" description="Outpout Open-Drain control for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO146" description="Outpout Open-Drain control for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO147" description="Outpout Open-Drain control for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO148" description="Outpout Open-Drain control for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO149" description="Outpout Open-Drain control for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO150" description="Outpout Open-Drain control for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO151" description="Outpout Open-Drain control for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO152" description="Outpout Open-Drain control for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO153" description="Outpout Open-Drain control for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO154" description="Outpout Open-Drain control for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO155" description="Outpout Open-Drain control for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO156" description="Outpout Open-Drain control for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO157" description="Outpout Open-Drain control for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO158" description="Outpout Open-Drain control for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO159" description="Outpout Open-Drain control for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="GPEGMUX1" width="32" page="1" offset="0x120" internal="0" description="GPIO E Peripheral Group Mux (GPIO128 to 143)">
		<bitfield id="GPIO128" description="Defines pin-muxing selection for GPIO128" begin="1" end="0" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO129" description="Defines pin-muxing selection for GPIO129" begin="3" end="2" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO130" description="Defines pin-muxing selection for GPIO130" begin="5" end="4" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO131" description="Defines pin-muxing selection for GPIO131" begin="7" end="6" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO132" description="Defines pin-muxing selection for GPIO132" begin="9" end="8" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO133" description="Defines pin-muxing selection for GPIO133" begin="11" end="10" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO134" description="Defines pin-muxing selection for GPIO134" begin="13" end="12" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO135" description="Defines pin-muxing selection for GPIO135" begin="15" end="14" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO136" description="Defines pin-muxing selection for GPIO136" begin="17" end="16" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO137" description="Defines pin-muxing selection for GPIO137" begin="19" end="18" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO138" description="Defines pin-muxing selection for GPIO138" begin="21" end="20" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO139" description="Defines pin-muxing selection for GPIO139" begin="23" end="22" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO140" description="Defines pin-muxing selection for GPIO140" begin="25" end="24" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO141" description="Defines pin-muxing selection for GPIO141" begin="27" end="26" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO142" description="Defines pin-muxing selection for GPIO142" begin="29" end="28" width="2" rwaccess="R/W"/>
		<bitfield id="GPIO143" description="Defines pin-muxing selection for GPIO143" begin="31" end="30" width="2" rwaccess="R/W"/>
	</register>
